name = input('Введите ваше имя: ')
exp = input('Введите название эксперимента: ')
zap = input('Введите количество запусков: ')
vr = input('Введите время одного запуска: ')
cc = input('Введите части комплексного числа: ').split()
has_runs = bool(zap)

print('========================================', f'ЭКСПЕРИМЕНТ: {exp}', f'Исследователь: {name}',
      f'Запуски: {zap}', f'Общее время: {float(vr) * float(zap)} ({float(vr) * (int(zap)) / 60} мин)',
      f'Коэффицент: {complex(float(cc[0]), float(cc[1]))}', f'Квадрат модуля: {(float(cc[0]) ** 2) + (float(cc[1]) ** 2)}',
      f'Есть выполненные запуски: {has_runs}', '========================================', sep='\n')
